/*************************************************************************
【文件名】adminprocess.cpp
【功能模块和目的】管理员业务流程类定义
【开发者及日期】范静涛(fanjingtao@tsinghua.edu.cn) 2020-5-10
【版权信息】开发者范静涛(fanjingtao@tsinghua.edu.cn)声明放弃任何版权诉求，任何使用者可做出任何修改、用于任何目的
【更改记录】2020-5-15 由范静涛增加注释
*************************************************************************/

#include "adminprocess.h"
#include "admin.h"

/*************************************************************************
【函数名称】AdminProcess::AdminProcess
【函数功能】管理员业务流程类构造函数，不允许在类外显性构造管理员对象（友元User类除外）
【参数】无
【返回值】构造函数不可有返回值
【开发者及日期】范静涛(fanjingtao@tsinghua.edu.cn) 2020-5-10
【更改记录】2020-5-15 由范静涛增加注释
*************************************************************************/
AdminProcess::AdminProcess() {

}


